wsdl_explaintion

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="Admi" targetNamespace="http://tempuri.org/Admi" xmlns="http://tempuri.org/Admi" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tempuri.org/Admi" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:documentation>
    <wsdl:appinfo source="WMQI_APPINFO">
      <MRWSDLAppInfo imported="true">
        <generatedXSD location="AdmiService_InlineSchema1.xsd"/>
        <binding hasEncoding="false" imported="true" name="AdmiSOAP_HTTP_Binding" originalBindingStyle="document"/>
      </MRWSDLAppInfo>
    </wsdl:appinfo>
  </wsdl:documentation>
  <wsdl:types>
    
          <xsd:schema targetNamespace="http://tempuri.org/Admi" xmlns:ibmSchExtn="http://www.ibm.com/schema/extensions" xmlns:mrm="http://tempuri.org/Admi">
<xsd:include schemaLocation="AdmiService_InlineSchema1.xsd"/>
    </xsd:schema>
    </wsdl:types>
  <wsdl:message name="SysEvtNtfctn_in">
    <wsdl:part element="SysEvtNtfctn" name="SysEvtNtfctn"/>
  </wsdl:message>
  <wsdl:message name="SysEvtNtfctn_out">
    <wsdl:part element="SysEvtNtfctn" name="SysEvtNtfctn"/>
  </wsdl:message>
  <wsdl:message name="SysEvtNtfctn_fault1">
    <wsdl:part element="SysEvtNtfctn" name="SysEvtNtfctn"/>
  </wsdl:message>
  <wsdl:message name="FinInstnId_in">
    <wsdl:part element="FinInstnId" name="FinInstnId"/>
  </wsdl:message>
  <wsdl:message name="FinInstnId_out">
    <wsdl:part element="FinInstnId" name="FinInstnId"/>
  </wsdl:message>
  <wsdl:message name="FinInstnId_fault1">
    <wsdl:part element="FinInstnId" name="FinInstnId"/>
  </wsdl:message>
  <wsdl:message name="Fr_in">
    <wsdl:part element="Fr" name="Fr"/>
  </wsdl:message>
  <wsdl:message name="Fr_out">
    <wsdl:part element="Fr" name="Fr"/>
  </wsdl:message>
  <wsdl:message name="Fr_fault1">
    <wsdl:part element="Fr" name="Fr"/>
  </wsdl:message>
  <wsdl:message name="AppHdr_in">
    <wsdl:part element="AppHdr" name="AppHdr"/>
  </wsdl:message>
  <wsdl:message name="AppHdr_out">
    <wsdl:part element="AppHdr" name="AppHdr"/>
  </wsdl:message>
  <wsdl:message name="AppHdr_fault1">
    <wsdl:part element="AppHdr" name="AppHdr"/>
  </wsdl:message>
  <wsdl:message name="To_in">
    <wsdl:part element="To" name="To"/>
  </wsdl:message>
  <wsdl:message name="To_out">
    <wsdl:part element="To" name="To"/>
  </wsdl:message>
  <wsdl:message name="To_fault1">
    <wsdl:part element="To" name="To"/>
  </wsdl:message>
  <wsdl:message name="EvtInf_in">
    <wsdl:part element="EvtInf" name="EvtInf"/>
  </wsdl:message>
  <wsdl:message name="EvtInf_out">
    <wsdl:part element="EvtInf" name="EvtInf"/>
  </wsdl:message>
  <wsdl:message name="EvtInf_fault1">
    <wsdl:part element="EvtInf" name="EvtInf"/>
  </wsdl:message>
  <wsdl:message name="RequestPayload_in">
    <wsdl:part element="RequestPayload" name="RequestPayload"/>
  </wsdl:message>
  <wsdl:message name="RequestPayload_out">
    <wsdl:part element="RequestPayload" name="RequestPayload"/>
  </wsdl:message>
  <wsdl:message name="RequestPayload_fault1">
    <wsdl:part element="RequestPayload" name="RequestPayload"/>
  </wsdl:message>
  <wsdl:message name="FIID_in">
    <wsdl:part element="FIId" name="FIId"/>
  </wsdl:message>
  <wsdl:message name="FIID_out">
    <wsdl:part element="FIId" name="FIId"/>
  </wsdl:message>
  <wsdl:message name="FIID_fault1">
    <wsdl:part element="FIId" name="FIId"/>
  </wsdl:message>
  <wsdl:message name="Document_in">
    <wsdl:part element="Document" name="Document"/>
  </wsdl:message>
  <wsdl:message name="Document_out">
    <wsdl:part element="Document" name="Document"/>
  </wsdl:message>
  <wsdl:message name="Document_fault1">
    <wsdl:part element="Document" name="Document"/>
  </wsdl:message>
  <wsdl:message name="ClrSysMmbld_in">
    <wsdl:part element="ClrSysMmbId" name="ClrSysMmbId"/>
  </wsdl:message>
  <wsdl:message name="ClrSysMmbld_out">
    <wsdl:part element="ClrSysMmbId" name="ClrSysMmbId"/>
  </wsdl:message>
  <wsdl:message name="ClrSysMmbld_fault1">
    <wsdl:part element="ClrSysMmbId" name="ClrSysMmbId"/>
  </wsdl:message>
  <wsdl:portType name="AdmiPortType">
    <wsdl:operation name="SysEvtNtfctn">
      <wsdl:input message="SysEvtNtfctn_in" name="SysEvtNtfctn_Input"/>
      <wsdl:output message="SysEvtNtfctn_out" name="SysEvtNtfctn_Output"/>
      <wsdl:fault message="SysEvtNtfctn_fault1" name="SysEvtNtfctn_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="FinInstnId">
      <wsdl:input message="FinInstnId_in" name="FinInstnId_Input"/>
      <wsdl:output message="FinInstnId_out" name="FinInstnId_Output"/>
      <wsdl:fault message="FinInstnId_fault1" name="FinInstnId_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="Fr">
      <wsdl:input message="Fr_in" name="Fr_Input"/>
      <wsdl:output message="Fr_out" name="Fr_Output"/>
      <wsdl:fault message="Fr_fault1" name="Fr_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="AppHdr">
      <wsdl:input message="AppHdr_in" name="AppHdr_Input"/>
      <wsdl:output message="AppHdr_out" name="AppHdr_Output"/>
      <wsdl:fault message="AppHdr_fault1" name="AppHdr_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="To">
      <wsdl:input message="To_in" name="To_Input"/>
      <wsdl:output message="To_out" name="To_Output"/>
      <wsdl:fault message="To_fault1" name="To_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="EvtInf">
      <wsdl:input message="EvtInf_in" name="EvtInf_Input"/>
      <wsdl:output message="EvtInf_out" name="EvtInf_Output"/>
      <wsdl:fault message="EvtInf_fault1" name="EvtInf_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="RequestPayload">
      <wsdl:input message="RequestPayload_in" name="RequestPayload_Input"/>
      <wsdl:output message="RequestPayload_out" name="RequestPayload_Output"/>
      <wsdl:fault message="RequestPayload_fault1" name="RequestPayload_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="FIID">
      <wsdl:input message="FIID_in" name="FIID_Input"/>
      <wsdl:output message="FIID_out" name="FIID_Output"/>
      <wsdl:fault message="FIID_fault1" name="FIID_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="Document">
      <wsdl:input message="Document_in" name="Document_Input"/>
      <wsdl:output message="Document_out" name="Document_Output"/>
      <wsdl:fault message="Document_fault1" name="Document_Fault"/>
    </wsdl:operation>
    <wsdl:operation name="ClrSysMmbld">
      <wsdl:input message="ClrSysMmbld_in" name="ClrSysMmbld_Input"/>
      <wsdl:output message="ClrSysMmbld_out" name="ClrSysMmbld_Output"/>
      <wsdl:fault message="ClrSysMmbld_fault1" name="ClrSysMmbld_Fault"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="AdmiSOAP_HTTP_Binding" type="AdmiPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="SysEvtNtfctn">
      <soap:operation soapAction=""/>
      <wsdl:input name="SysEvtNtfctn_Input">
        <soap:body parts="SysEvtNtfctn" use="literal"/>
      </wsdl:input>
      <wsdl:output name="SysEvtNtfctn_Output">
        <soap:body parts="SysEvtNtfctn" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="SysEvtNtfctn_Fault">
        <soap:fault name="SysEvtNtfctn_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="FinInstnId">
      <soap:operation soapAction=""/>
      <wsdl:input name="FinInstnId_Input">
        <soap:body parts="FinInstnId" use="literal"/>
      </wsdl:input>
      <wsdl:output name="FinInstnId_Output">
        <soap:body parts="FinInstnId" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="FinInstnId_Fault">
        <soap:fault name="FinInstnId_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="Fr">
      <soap:operation soapAction=""/>
      <wsdl:input name="Fr_Input">
        <soap:body parts="Fr" use="literal"/>
      </wsdl:input>
      <wsdl:output name="Fr_Output">
        <soap:body parts="Fr" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="Fr_Fault">
        <soap:fault name="Fr_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="AppHdr">
      <soap:operation soapAction=""/>
      <wsdl:input name="AppHdr_Input">
        <soap:body parts="AppHdr" use="literal"/>
      </wsdl:input>
      <wsdl:output name="AppHdr_Output">
        <soap:body parts="AppHdr" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="AppHdr_Fault">
        <soap:fault name="AppHdr_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="To">
      <soap:operation soapAction=""/>
      <wsdl:input name="To_Input">
        <soap:body parts="To" use="literal"/>
      </wsdl:input>
      <wsdl:output name="To_Output">
        <soap:body parts="To" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="To_Fault">
        <soap:fault name="To_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="EvtInf">
      <soap:operation soapAction=""/>
      <wsdl:input name="EvtInf_Input">
        <soap:body parts="EvtInf" use="literal"/>
      </wsdl:input>
      <wsdl:output name="EvtInf_Output">
        <soap:body parts="EvtInf" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="EvtInf_Fault">
        <soap:fault name="EvtInf_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="RequestPayload">
      <soap:operation soapAction=""/>
      <wsdl:input name="RequestPayload_Input">
        <soap:body parts="RequestPayload" use="literal"/>
      </wsdl:input>
      <wsdl:output name="RequestPayload_Output">
        <soap:body parts="RequestPayload" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="RequestPayload_Fault">
        <soap:fault name="RequestPayload_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="FIID">
      <soap:operation soapAction=""/>
      <wsdl:input name="FIID_Input">
        <soap:body parts="FIId" use="literal"/>
      </wsdl:input>
      <wsdl:output name="FIID_Output">
        <soap:body parts="FIId" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="FIID_Fault">
        <soap:fault name="FIID_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="Document">
      <soap:operation soapAction=""/>
      <wsdl:input name="Document_Input">
        <soap:body parts="Document" use="literal"/>
      </wsdl:input>
      <wsdl:output name="Document_Output">
        <soap:body parts="Document" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="Document_Fault">
        <soap:fault name="Document_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="ClrSysMmbld">
      <soap:operation soapAction=""/>
      <wsdl:input name="ClrSysMmbld_Input">
        <soap:body parts="ClrSysMmbId" use="literal"/>
      </wsdl:input>
      <wsdl:output name="ClrSysMmbld_Output">
        <soap:body parts="ClrSysMmbId" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="ClrSysMmbld_Fault">
        <soap:fault name="ClrSysMmbld_Fault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="AdmiSOAP_HTTP_Service">
    <wsdl:port binding="AdmiSOAP_HTTP_Binding" name="AdmiSOAP_HTTP_Port">
      <soap:address location="http://localhost:7800/AdmiSOAP_HTTP_Service"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
--------------------------
Here are detailed, structured notes from the provided article on Web Services Description Language (WSDL) — suitable for revision and long-term reference:


---

WSDL (Web Services Description Language) - Notes

1. Introduction

WSDL is an XML-based language for describing web services.

Submitted as a standard to W3C (World Wide Web Consortium).

WSDL allows:

Description of business operations

Separation of operations and their implementation details




---

2. Key Architectural Principles

Abstract descriptions of:

Messages (data exchanged)

Port types (collections of operations)


Concrete descriptions:

Bindings (protocols and data formats)

Ports (network address with bindings)


Service: A collection of ports.



---

3. WSDL File Structure

A. Web Service Interface Definition

Includes elements and namespaces


B. Web Service Implementation

Includes services and ports



---

4. Core Elements of a WSDL Document

a. portType

Defines abstract operations and messages.


<portType name="EightBall">
  <operation name="getAnswer">
    <input message="ebs:IngetAnswerRequest"/>
    <output message="ebs:OutgetAnswerResponse"/>
  </operation>
</portType>


---

b. message

Describes input/output parameters.


<message name="IngetAnswerRequest">
  <part name="meth1_inType" type="ebs:questionType"/>
</message>
<message name="OutgetAnswerResponse">
  <part name="meth1_outType" type="ebs:answerType"/>
</message>


---

c. types

Contains XML Schema Definitions (XSD) for data types.


<types>
  <xsd:schema targetNamespace="...">
    <xsd:complexType name="questionType">
      <xsd:element name="question" type="string"/>
    </xsd:complexType>
  </xsd:schema>
</types>


---

d. binding

Specifies the protocol and format for operations.


<binding name="EightBallBinding" type="ebs:EightBall">
  <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
  <operation name="getAnswer">
    <soap:operation soapAction="urn:EightBall"/>
    <input>
      <soap:body namespace="urn:EightBall"/>
    </input>
  </operation>
</binding>


---

e. service and port

Define web service location and access method.


<service name="EightBall">
  <port binding="ebs:EightBallBinding" name="EightBallPort">
    <soap:address location="http://localhost:8080/axis/EightBall"/>
  </port>
</service>


---

5. Development Approaches

JAX-WS (Java API for XML Web Services)

Bottom-up: Start from Java class, generate WSDL using wsgen.

Top-down: Start from WSDL, generate classes using wsimport.


JAX-RPC (Java API for XML-based RPC)

Start with implementation bean with Service Endpoint Interface (SEI)

Use tools:

Java2WSDL: Generates WSDL

WSDL2Java: Generates Java classes




---

6. Multipart WSDL

One WSDL imports another using <wsdl:import>

Common structure:

Interface WSDL: Abstract definitions

Implementation WSDL: Service and port definitions


File placement:

EJB: META-INF/wsdl

JavaBeans: WEB-INF/wsdl



Import Rules

Relative imports must be in the same directory

Web URLs must be accessible at runtime



---

7. WSDL Publication

Files in META-INF/wsdl or WEB-INF/wsdl can be:

Referenced in <wsdl-file> of webservices.xml

Published via file or URL


Files not in these directories may not be published correctly



---

8. Annotation in JAX-WS

Use @WebService(wsdlLocation="...") to specify WSDL file

If not specified, WSDL is auto-generated from class annotations

webservices.xml can override annotation values



---

9. Tools Summary


---

10. Best Practices

Keep all WSDL/XSD in appropriate directories.

Avoid relative paths in wsdl:import.

Ensure all external WSDL/XSDs are accessible during deployment.



---

Let me know if you want this in PDF or formatted for OneNote, Notion, or any other platform.
