transfer

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:admi="http://tempuri.org/Admi">
   <soapenv:Header/>
   <soapenv:Body>
      <admi:RequestPayload>
         <admi:AppHdr xm="?">
            <admi:Fr>
               <admi:FIId>
                  <admi:FinInstnId>
                     <admi:ClrSysMmbId>
                        <admi:MmbId>?</admi:MmbId>
                     </admi:ClrSysMmbId>
                  </admi:FinInstnId>
               </admi:FIId>
            </admi:Fr>
            <admi:To>
               <admi:FIId>
                  <admi:FinInstnId>
                     <admi:ClrSysMmbId>
                        <admi:MmbId>123</admi:MmbId>
                     </admi:ClrSysMmbId>
                  </admi:FinInstnId>
               </admi:FIId>
            </admi:To>
            <admi:BizMsgIdr></admi:BizMsgIdr>
            <admi:MsgDefIdr>567</admi:MsgDefIdr>
            <admi:BizSvc>989</admi:BizSvc>
            <admi:CreDt>890</admi:CreDt>
         </admi:AppHdr>
         <admi:Document>
            <admi:SysEvtNtfctn>
               <admi:EvtInf>
                  <admi:EvtCd>876</admi:EvtCd>
                  <admi:EvtParam>876</admi:EvtParam>
                  <admi:EvtDesc>76</admi:EvtDesc>
                  <admi:EvtTm>87689878</admi:EvtTm>
               </admi:EvtInf>
            </admi:SysEvtNtfctn>
         </admi:Document>
      </admi:RequestPayload>
   </soapenv:Body>
</soapenv:Envelope>
==============================================================================================================================================
DECLARE inref REFERENCE TO InputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr;		
		
		DECLARE test1 CHARACTER;
		DECLARE test2 CHARACTER;
		DECLARE test3 CHARACTER;
		
		set test1 = InputRoot.SOAP.Body.admi:RequestPayload.admi:Document.admi:SysEvtNtfctn.admi:EvtInf.admi:EvtCd;
		
		set test2 =InputRoot.SOAP.Body.admi:AppHdr.admi:BizMsgIdr;
		
		set test3 =InputRoot.SOAP.Body.admi:RequestPayload.admi:AppHdr.admi:BizMsgIdr;
		
		
		IF  test1 IS NULL OR test3 IS NULL THEN
			
			SET OutputRoot.XMLNSC.soapenv:Envelope.(XMLNSC.NamespaceDecl)xmlns:soapenv = soapenv;
			SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.soapenv:Fault.faultcode = '400';
			SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.soapenv:Fault.faultstring = 'BizMsgIdr is missing';
			RETURN;
		END IF;

		
		
		SET OutputRoot.XMLNSC.soapenv:Envelope.(XMLNSC.NamespaceDecl)xmlns:soapenv = soapenv;
		SET OutputRoot.XMLNSC.soapenv:Envelope.(XMLNSC.NamespaceDecl)xmlns:admi = admi;

		
		CREATE LASTCHILD OF OutputRoot.XMLNSC.soapenv:Envelope  NAME 'soapenv:Header';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.(XMLNSC.Attribute)xm = 'exampleValue';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:Fr.admi:FIId.admi:FinInstnId.admi:ClrSysMmbId.admi:MmbId = 'FR123456';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:To.admi:FIId.admi:FinInstnId.admi:ClrSysMmbId.admi:MmbId = 'TO987654';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:BizMsgIdr = 987654;
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:MsgDefIdr = 'pacs.002.001.09';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:BizSvc = 'TransferService';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:AppHdr.admi:CreDt = '2025-04-14T10:30:00Z';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:Document.admi:SysEvtNtfctn.admi:EvtInf.admi:EvtCd = 'EVT001';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:Document.admi:SysEvtNtfctn.admi:EvtInf.admi:EvtParam = 'Threshold breach';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:Document.admi:SysEvtNtfctn.admi:EvtInf.admi:EvtDesc = 'System threshold exceeded during processing.';
		SET OutputRoot.XMLNSC.soapenv:Envelope.soapenv:Body.admi:RequestPayload.admi:Document.admi:SysEvtNtfctn.admi:EvtInf.admi:EvtTm = '2025-04-14T10:45:00Z';
=============================================================================================================
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:admi="http://tempuri.org/Admi">
    <soapenv:Header/>
    <soapenv:Body>
        <admi:RequestPayload>
            <admi:AppHdr xm="exampleValue">
                <admi:Fr>
                    <admi:FIId>
                        <admi:FinInstnId>
                            <admi:ClrSysMmbId>
                                <admi:MmbId>FR123456</admi:MmbId>
                            </admi:ClrSysMmbId>
                        </admi:FinInstnId>
                    </admi:FIId>
                </admi:Fr>
                <admi:To>
                    <admi:FIId>
                        <admi:FinInstnId>
                            <admi:ClrSysMmbId>
                                <admi:MmbId>TO987654</admi:MmbId>
                            </admi:ClrSysMmbId>
                        </admi:FinInstnId>
                    </admi:FIId>
                </admi:To>
                <admi:BizMsgIdr>987654</admi:BizMsgIdr>
                <admi:MsgDefIdr>pacs.002.001.09</admi:MsgDefIdr>
                <admi:BizSvc>TransferService</admi:BizSvc>
                <admi:CreDt>2025-04-14T10:30:00Z</admi:CreDt>
            </admi:AppHdr>
            <admi:Document>
                <admi:SysEvtNtfctn>
                    <admi:EvtInf>
                        <admi:EvtCd>EVT001</admi:EvtCd>
                        <admi:EvtParam>Threshold breach</admi:EvtParam>
                        <admi:EvtDesc>System threshold exceeded during processing.</admi:EvtDesc>
                        <admi:EvtTm>2025-04-14T10:45:00Z</admi:EvtTm>
                    </admi:EvtInf>
                </admi:SysEvtNtfctn>
            </admi:Document>
        </admi:RequestPayload>
    </soapenv:Body>
</soapenv:Envelope>
